title: Convert Rule Test
id: 93199800-b52a-4dec-b762-75212c196556
status: test
description: Detects the use of process_perflez3.pl
references:
    - https://www.d7xtech.com/free-software/runx/
    - https://www.winhelponline.com/blog/run-program-as-system-localsystem-account-windows/
author: pizza53
date: 2022/01/24
modified: 2023/02/14
tags:
    - attack.execution
    - attack.t1569.002
    - attack.s0029
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        CommandLine|contains: 'process_perflez3.pl'
    condition: selection
fields:
    - CommandLine
    - ParentCommandLine
falsepositives:
    - Legitimate use by administrators
level: high
